Lecutres 3/rd week
